In [1]:
numbers = [1, 2, 3, 4, 5]

for i in numbers:
    print(i)


for i in range(1,6):
    print(i)
    
print(numbers)

1
2
3
4
5
1
2
3
4
5
[1, 2, 3, 4, 5]

In [2]:
numbers = [1, 2, 3, 4, 5]

for i in range(1,6):
    print(i)
    
print(numbers)

simpsons = {'Dad':'Homer',
            'Mum':'Marge',
            'Baby':'Maggie'}


for family_member, name in simpsons.items():
    print(f'{name} is the {family_member}')

1
2
3
4
5
[1, 2, 3, 4, 5]
Homer is the Dad
Marge is the Mum
Maggie is the Baby

In [3]:
side_characters = ['Barney', 'Ned', 'Krusty', 'Sideshow Bob']

for i, name in enumerate(side_characters):
    side_characters[i] = f'{name} Simpson'

print(side_characters)

['Barney Simpson', 'Ned Simpson', 'Krusty Simpson', 'Sideshow Bob Simpson']

In [4]:
import pandas as pd 

df_1 = pd.DataFrame({'col 1':['foo', 'bar', 'baz'],
                     'col 2':[1, 2, 3]})

df_2 = pd.DataFrame({'col 1': ['Thing 1', 'Thing 2', 'Thing 3'],
                     'col 2':['Green', 'Eggs', 'Ham']})

df_dict = {'Dataframe 1':df_1,
           'Dataframe 2':df_2}

for k, v in df_dict.items():
    v['originator'] = k

df_dict['Dataframe 1']

  col 1  col 2   originator
0   foo      1  Dataframe 1
1   bar      2  Dataframe 1
2   baz      3  Dataframe 1

In [33]:
child_identifiers = pd.DataFrame({'child_id':['child1', 'child2', 'child3', 'child4'],
              'age_first_contact':[6, 10, 12, 13],
              'Gender':['M', 'M', 'M', 'F']})


nhs_nums = pd.DataFrame({'child_id':['child1', 'child2', 'child3', 'child4'],
              'nhs_numbers':['nhs1', 'nhs2', 'nhs3', 'nhs4']})


ident_nhs = child_identifiers.merge(nhs_nums, how='left', left_on='child_id', right_on='child_id')

# ident_nhs = child_identifiers.merge(nhs_nums, how='left', on='child_id')

print(ident_nhs)

  child_id  age_first_contact Gender nhs_numbers
0   child1                  6      M        nhs1
1   child2                 10      M        nhs2
2   child3                 12      M        nhs3
3   child4                 13      F        nhs4

In [37]:
cp_plans = pd.DataFrame({'child_id':['child1', 'child4'],
                        'cp_start_date':['01/01/2023', '01/0/1/2000']})

df_left = ident_nhs.merge(cp_plans, how='left', on='child_id')
df_left['cp_start_date'] = df_left['cp_start_date'].fillna('no cp plan')

df_inner = ident_nhs.merge(cp_plans, how='inner', on='child_id')

print(df_left)
print(df_inner)

  child_id  age_first_contact Gender nhs_numbers cp_start_date
0   child1                  6      M        nhs1    01/01/2023
1   child2                 10      M        nhs2    no cp plan
2   child3                 12      M        nhs3    no cp plan
3   child4                 13      F        nhs4   01/0/1/2000
  child_id  age_first_contact Gender nhs_numbers cp_start_date
0   child1                  6      M        nhs1    01/01/2023
1   child4                 13      F        nhs4   01/0/1/2000

In [6]:
x = 1
numbers_list = []

for i in list(range(10)):
    numbers_list.append(x)
    x = (x + numbers_list[i-1])

numbers_list

[1, 2, 3, 5, 8, 13, 21, 34, 55, 89]

In [14]:
answers = []
times_tables = {}
for i in list(range(1,11)):
    for j in list(range(1,11)):
        answers.append(i * j)
    times_tables[i] = answers
    answers = []



multiplication_table = pd.DataFrame(times_tables)
multiplication_table.index += 1
multiplication_table

# Using the examples above, in this cell use a loop to populate a dicitonary that you'll then use to make a dataframe of all the 
# possible combinations of sandwiches
# from the following two lists. Don't think too hard, it doesn't matter if combinations are repeated. 
# You'll want the following three lines of the code at the end to format the dataframe:
# combinations_df = (pd.DataFrame(combinations)) 
# combinations_df['topping'] = toppings
# combinations_df.set_index('topping')

spreads = ['butter', 'jam', 'peanut butter']
toppings = ['ham', 'cheese', 'sardines']
filling = []
combinations = {}

In [27]:
mixins = []
sandwiches = {}

for spread in spreads:
    for topping in toppings:
        mixins.append(f'{spread} {topping}')
    sandwiches[spread] = mixins
    mixins = []   

combinations_df = pd.DataFrame(sandwiches)
combinations_df['topping'] = toppings
# combinations_df.set_index('topping', inplace=True)



combinations_df = combinations_df[['topping', 'butter', 'jam', 'peanut butter']]
combinations_df

    topping           butter           jam           peanut butter
0       ham       butter ham       jam ham       peanut butter ham
1    cheese    butter cheese    jam cheese    peanut butter cheese
2  sardines  butter sardines  jam sardines  peanut butter sardines

In [8]:
import pandas as pd

# Read in the house prices CSV from the data folder as a dataframe
# Convert the date column to datetime (format="%Y-%m")
# Make a list with the highest, lowest, and mean, and median house prices
# Write a loop to print each value of that list seperately

df = pd.read_csv('/workspaces/ERN-sessions/data/1980 2023 average house prices.csv')
df['Period'] = pd.to_datetime(df['Period'], format="%Y-%m")

high = df['Average price All property types'].max()
low = df['Average price All property types'].min()
mean = df['Average price All property types'].mean()
median = df['Average price All property types'].median()

house_info_list = [high, low, mean, median]

292187
19273
120570.55831739961
97964.0

In [9]:
words = ['high', 'low', 'mean', 'median']

for i in [0, 1, 2, 3]:
    print(f'{words[i]}: {house_info_list[i]}')

high: 292187
low: 19273
mean: 120570.55831739961
median: 97964.0

In [13]:
print((1 > 2) & (2 == 2)) #and statement 
print((1 > 2) | (2 == 2)) 
print((3 > 2) | (2 == 2))
print((3 > 2) & (2 == 2))

# In this cell, write a logical test that fails an and condition, but passes an or condition, and print both

False
True
True
True

In [25]:
over_mean = df['Average price All property types'] > df['Average price All property types'].mean()
under_median = df['Average price All property types'] < df['Average price All property types'].median()

condition = over_mean | under_median
df_over_under = df[~condition]
df_over_under

# Percentage change (monthly) All property types is less than the mean
# Percentage change (yearly) All property types is less than the median
# return the df where both of these are true

,Name,Period,House price index All property types,Average price All property types,Percentage change (monthly) All property types,Percentage change (yearly) All property types
258,United Kingdom,2001-07-01,52.43,99971,3.60,9.96
259,United Kingdom,2001-08-01,52.43,99971,3.60,9.96
260,United Kingdom,2001-09-01,52.43,99971,3.60,9.96
261,United Kingdom,2001-10-01,51.38,97964,-2.01,4.63
262,United Kingdom,2001-11-01,51.38,97964,-2.01,4.63
263,United Kingdom,2001-12-01,51.38,97964,-2.01,4.63
265,United Kingdom,2002-02-01,53.06,101164,3.63,8.62
266,United Kingdom,2002-03-01,54.92,104705,3.50,12.42
267,United Kingdom,2002-04-01,55.66,106121,1.35,9.97
268,United Kingdom,2002-05-01,57.09,108852,2.57,12.80
269,United Kingdom,2002-06-01,59.43,113304,4.09,17.41
270,United Kingdom,2002-07-01,59.90,114214,0.80,14.25
271,United Kingdom,2002-08-01,61.23,116743,2.21,16.78
272,United Kingdom,2002-09-01,62.72,119576,2.43,19.61
273,United Kingdom,2002-10-01,63.19,120486,0.76,22.99

In [26]:

# Percentage change (monthly) All property types is less than the mean
# Percentage change (yearly) All property types is less than the median
# return the df where both of these are true
less_mean = df['Percentage change (monthly) All property types'] < df['Percentage change (monthly) All property types'].mean()
less_median = df['Percentage change (yearly) All property types'] < df['Percentage change (yearly) All property types'].median()

condition = less_mean & less_median
df_change = df[condition]
df_change

,Name,Period,House price index All property types,Average price All property types,Percentage change (monthly) All property types,Percentage change (yearly) All property types
21,United Kingdom,1981-10-01,11.24,21425,-1.95,2.53
22,United Kingdom,1981-11-01,11.24,21425,-1.95,2.53
23,United Kingdom,1981-12-01,11.24,21425,-1.95,2.53
24,United Kingdom,1982-01-01,10.96,20897,-2.46,-0.19
25,United Kingdom,1982-02-01,10.96,20897,-2.46,-0.19
...,...,...,...,...,...,...
518,United Kingdom,2023-03-01,148.20,282548,-1.00,3.20
519,United Kingdom,2023-04-01,148.90,283871,0.50,2.50
520,United Kingdom,2023-05-01,149.50,285053,0.40,1.60
521,United Kingdom,2023-06-01,151.20,288281,1.10,1.90
522,United Kingdom,2023-07-01,152.00,289824,0.50,0.60

In [33]:
df = pd.DataFrame({'ChildId':['id1', 'id2', 'id3', 'id4', 'id5'],
                   'Age first contact':[6,12,11,1,19],
                   'Gender':['M','m', 'F', '', 'F' ],
                   'Birthday':['01/01/2002', '02/02/2003', pd.NA, '03/03/2023', '06/01/2012'],
                   'Age':[5,12,11,6,2],
                   'CP Plan?':['Y', 'n', 'N', 'No', 'yES'],})
df['Birthday'] = pd.to_datetime(df['Birthday'], dayfirst=True)
df

# return columns where age first contact is older than age
condition_1 = df['Age'] < df['Age first contact']
# return columns where CP Plan? has a Y in it, df['column name'].str.lower()
condition_2 = df['CP Plan?'].str.lower().str.contains('y')
# return rows where both of these are true 
age_error_cp_plan = df[(df['Age'] < df['Age first contact']) & 
                       (df['CP Plan?'].str.lower().str.contains('y'))]
age_error_cp_plan

  ChildId  Age first contact Gender   Birthday  Age CP Plan?
0     id1                  6      M 2002-01-01    5        Y
4     id5                 19      F 2012-01-06    2      yES

In [3]:
# if (where something is true, do this)
# else (if the if statement wasn't true, do this)
# elif else-if (if that wasn't true but this is, do this)

list_nums = list(range(1, 21))

# for number in list_nums:
#     if number %2 == 0:
#         print(f'{number} is even')
#     else:
#         print(f'{number} is odd')

# is a number an even number, use the modulus sign %
# != (not equal to)

new_nums = range(21)
evens = []
odds = []

for i in new_nums:
    if (i %2 == 0) & (i != 0):
        #print("It's even")
        evens.append(i)
    elif (i %2 != 0) & (i != 0):
        #print("it's odd")
        odds.append(i)
    else:
        print('It must be zero') 
        
print(evens)
# extension - add the numbers to relevant lists

It must be zero
[2, 4, 6, 8, 10, 12, 14, 16, 18, 20]

In [10]:
# import pandas with the correct alias
# read in the house prices data as a dataframe with a suitable name
# have a look at the dataframe
# make sure columns have the right data type (eg date)
# find the highest and lowest average monthly change
# slice out rows with monthly change above averge only

import pandas as pd

house_prices = pd.read_csv('/workspaces/ERN-sessions/data/1980 2023 average house prices.csv')

house_prices['Period'] = pd.to_datetime(house_prices['Period'], format="%Y-%m")
#house_prices.info()

# print(f"Maximum percantage change: {house_prices['Percentage change (monthly) All property types'].max()}")
# print(f"Minimum percantage change: {house_prices['Percentage change (monthly) All property types'].min()}")

condition = (house_prices['Percentage change (monthly) All property types'] 
             > house_prices['Percentage change (monthly) All property types'].mean())

over_monthly_change = house_prices[condition]

over_monthly_change

,Name,Period,House price index All property types,Average price All property types,Percentage change (monthly) All property types,Percentage change (yearly) All property types
0,United Kingdom,1980-01-01,10.11,19273,3.94,28.59
1,United Kingdom,1980-02-01,10.11,19273,3.94,28.59
2,United Kingdom,1980-03-01,10.11,19273,3.94,28.59
3,United Kingdom,1980-04-01,10.51,20044,4.00,24.15
4,United Kingdom,1980-05-01,10.51,20044,4.00,24.15
...,...,...,...,...,...,...
500,United Kingdom,2021-09-01,141.09,269003,3.29,11.37
502,United Kingdom,2021-11-01,140.23,267370,1.53,8.66
504,United Kingdom,2022-01-01,143.05,272738,1.72,9.23
508,United Kingdom,2022-05-01,147.10,280433,1.30,11.60
510,United Kingdom,2022-07-01,151.10,288156,1.90,13.80

In [12]:
numbers_list = [1, 2, 3, 4, 5]

for i in numbers_list:
    print(i)

1
2
3
4
5

In [15]:
job_dict = {'Will':'Instructing',
             'Emily':'Performance Analyst',
             'Jon': 'Performance M.',
             'Emma': 'Perf. O.',
             'Paul M': 'Perf. O.',
             'Michael M': 'Regional M.',
             'Alasdair':'SQL Dev.',
             'Michael C': 'Analyst',
             'Paul D': 'Senior Perf. M.',
             'Nazahah': 'Analyst',
             'Martin H':'SQL Dev.'}

for key, value in job_dict.items():
    print(key, value)

Will Instructing
Emily Performance Analyst
Jon Performance M.
Emma Perf. O.
Paul M Perf. O.
Michael M Regional M.
Alasdair SQL Dev.
Michael C Analyst
Paul D Senior Perf. M.
Nazahah Analyst
Martin H SQL Dev.

In [26]:
up_to_100 = list(range(1, 101,))

total_odds = 0

for number in up_to_100:
    if (number %2 == 0):
        total_odds += number

print(total_odds)

2550